app/controllers/books_controller.rb

	def create
	  @book = Book.new(book_params)
	  if @book.save
---
INSERT INTO `books` (`title`, `author`, `created_at`, `updated_at`, `status`) VALUES ('aaadfdfd', 'bbb', '2018-01-14 18:10:01', '2018-01-14 18:10:01', 'Available')

	def issue_book_to_user
	  issued_user = User.find_by_name(params[:issued_to])
	  if issued_user
	  	if issued_user.books.count < 3
		    if @book.update_attributes(user_id: issued_user.id, status: 'Issued')
---
SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'anupamc' LIMIT 1
UPDATE `books` SET `user_id` = 1, `status` = 'Issued', `updated_at` = '2018-01-14 18:19:21' WHERE `books`.`id` = 1

  def set_book
    @book = Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1