app/controllers/users_controller.rb

	def create
	  @user = User.new(user_params)
	  if @user.save
---
INSERT INTO `users` (`name`, `created_at`, `updated_at`) VALUES ('anupam', '2018-01-14 17:45:10', '2018-01-14 17:45:10')